const text = document.createElement('div');

text.innerHTML = `
    <p>Ти казала в понедiлок – пiдем разом по барвiнок.
    <br>
    Я прийшов, тебе нема, підманула, підвела.
    <br>
    Ти ж мене підманула, ти ж мене підвела.
    <br>
    Ти ж мене, молодого, з ума розуму звела.
    <br>
    Я казала у вiвторок – поцiлую разiв сорок.
    <br>
    Ти прийшов, мене нема, підманула, підвела.
    <br>
    Я ж тебе підманула, я ж тебе підвела.
    <br>
    Я ж тебе, молодого, з ума розуму звела.
    <br>
    Ти казала у середу – пiдем разом по череду.
    <br>
    Я прийшов, тебе нема, підманула, підвела.
    <br>
    Ти ж мене підманула, ти ж мене підвела.
    <br>
    Ти ж мене, молодого, з ума розуму звела.
    <br>
    Я казала у четвер – пiдем разом на концерт.
    <br>
    Ти прийшов, мене нема, підманула, підвела.
    <br>
    Ти ж мене підманула, ти ж мене підвела.
    <br>
    Ти ж мене, молодого, з ума розуму звела.
    <br>
    Ти казала у п’ятницю – пiдем разом по пшеницю.
    <br>
    Я прийшов, тебе нема, підманула, підвела.
    <br>
    Я ж тебе підманула, ти ж мене підвела.
    <br>
    Ти ж його, молодого, з ума розуму звела.
    <br>
    Я казала у суботу – пiдем разом на роботу.
    <br>
    Я прийшов, тебе нема, підманула, підвела.
    <br>
    Я ж тебе підманула, ти ж мене підвела.
    <br>
    Ти ж його, молодого, з ума розуму звела.
    <br>
    Я казала у недiлю – пiдем разом на весiлля.
    <br>
    Я прийшов, тебе нема, підманула, підвела.
    <br>
    Ти ж мене підманула, ти ж мене підвела.
    <br>
    Ти ж мене, молодого, з ума розуму звела.</p>
`

const wordsToReplace = ['підманула', 'підвела', 'понедiлок', 'вiвторок', 'середу', 'четвер', 'п’ятницю', 'суботу', 'недiлю'];

const regExpPattern = new RegExp(wordsToReplace.join('|'), 'gi');

const replacedText = text.innerHTML.replace(regExpPattern, (match) => '*'.repeat(match.length));

text.innerHTML = replacedText; 

document.body.appendChild(text);

